#+title: Exercises

** Determining bitwise representation of a digit

third layer have activation at least 0.99. incorrect has 0.01

| decimal | binary |
|---------+--------|
|       0 |   0000 |
|       1 |   0001 |
|       2 |   0010 |
|       3 |   0011 |
|       4 |   0100 |
|       5 |   0101 |
|       6 |   0110 |
|       7 |   0111 |
|       8 |   1000 |
|       9 |   1001 |

sigmoid definition

\begin{eqnarray*}
  \sigma(\sum_j w_j x_j+b)
\end{eqnarray*}

which is the sum of all weights plus the bias

#+begin_src python
import math

def sigm(x):
    return 1 / (1 + math.exp(-x))

def f(actvns, weights, bias):
    sum=0;
    for i, a in enumerate(actvns):
        sum+=a*weights[i]
    return 0 if sigm(sum + bias) < 0.5 else 1

def calculate(num):
    actvns=[0.99 if x == num else 0.01 for x in range(10)]

    o3 = f(actvns, [-1, 1,-1, 1,-1, 1,-1, 1,-1, 1], 0);
    o2 = f(actvns, [-1,-1, 1, 1,-1,-1, 1, 1,-1,-1], 0);
    o1 = f(actvns, [-1,-1,-1,-1, 1, 1, 1, 1,-1,-1], 0);
    o0 = f(actvns, [-1,-1,-1,-1,-1,-1,-1,-1, 1, 1], 0);
    return str(o0) + str(o1) + str(o2) + str(o3)

output = ""
for i in range(10):
    output += str(i) + ": " + calculate(i) + "\n";

return output
#+end_src

#+RESULTS:
#+begin_example
0: 0000
1: 0001
2: 0010
3: 0011
4: 0100
5: 0101
6: 0110
7: 0111
8: 1000
9: 1001
#+end_example

